---
kind: type
id: T:Autodesk.Revit.DB.FilledRegion
source: html/3685651c-a789-3550-f6bb-7c1decc29079.htm
---
# Autodesk.Revit.DB.FilledRegion

A filled region element.

## Syntax (C#)
```csharp
public class FilledRegion : Element
```